03-raw-benchmark-runs/flowplane-connect-byteconverter-100rps-3min-20260613-031931/s3-100rps-20260613-031935-100rps/producer.log
Reading payloads from: /tmp/flowplane-connect-byteconverter-100rps-3min-20260613-031931-payloads.jsonl
Number of messages read: 50
501 records sent, 100.2 records/sec (99.38 MB/sec), 7.4 ms avg latency, 185.0 ms max latency.
501 records sent, 100.1 records/sec (99.24 MB/sec), 6.0 ms avg latency, 11.0 ms max latency.
500 records sent, 99.9 records/sec (99.12 MB/sec), 6.1 ms avg latency, 13.0 ms max latency.
501 records sent, 100.1 records/sec (99.30 MB/sec), 6.2 ms avg latency, 13.0 ms max latency.
500 records sent, 99.9 records/sec (99.12 MB/sec), 6.0 ms avg latency, 10.0 ms max latency.
500 records sent, 100.0 records/sec (99.14 MB/sec), 6.0 ms avg latency, 13.0 ms max latency.
501 records sent, 100.0 records/sec (99.18 MB/sec), 6.1 ms avg latency, 21.0 ms max latency.
501 records sent, 100.1 records/sec (99.30 MB/sec), 5.8 ms avg latency, 13.0 ms max latency.
500 records sent, 100.0 records/sec (99.14 MB/sec), 5.8 ms avg latency, 11.0 ms max latency.
500 records sent, 99.9 records/sec (99.12 MB/sec), 5.9 ms avg latency, 9.0 ms max latency.
501 records sent, 100.0 records/sec (99.16 MB/sec), 6.3 ms avg latency, 48.0 ms max latency.
501 records sent, 100.1 records/sec (99.26 MB/sec), 5.9 ms avg latency, 10.0 ms max latency.
501 records sent, 100.1 records/sec (99.24 MB/sec), 5.8 ms avg latency, 9.0 ms max latency.
500 records sent, 99.9 records/sec (99.10 MB/sec), 5.9 ms avg latency, 9.0 ms max latency.
501 records sent, 100.0 records/sec (99.22 MB/sec), 5.7 ms avg latency, 9.0 ms max latency.
500 records sent, 100.0 records/sec (99.14 MB/sec), 5.9 ms avg latency, 13.0 ms max latency.
501 records sent, 100.1 records/sec (99.30 MB/sec), 5.8 ms avg latency, 12.0 ms max latency.
500 records sent, 100.0 records/sec (99.16 MB/sec), 6.1 ms avg latency, 123.0 ms max latency.
500 records sent, 99.9 records/sec (99.10 MB/sec), 5.8 ms avg latency, 11.0 ms max latency.
501 records sent, 100.0 records/sec (99.18 MB/sec), 6.0 ms avg latency, 13.0 ms max latency.
501 records sent, 100.2 records/sec (99.36 MB/sec), 5.7 ms avg latency, 13.0 ms max latency.
500 records sent, 100.0 records/sec (99.16 MB/sec), 5.7 ms avg latency, 13.0 ms max latency.
500 records sent, 99.9 records/sec (99.04 MB/sec), 5.8 ms avg latency, 12.0 ms max latency.
501 records sent, 100.2 records/sec (99.34 MB/sec), 5.8 ms avg latency, 11.0 ms max latency.
500 records sent, 99.9 records/sec (99.06 MB/sec), 5.7 ms avg latency, 9.0 ms max latency.
501 records sent, 100.1 records/sec (99.26 MB/sec), 5.8 ms avg latency, 11.0 ms max latency.
500 records sent, 99.9 records/sec (99.08 MB/sec), 5.8 ms avg latency, 10.0 ms max latency.
500 records sent, 100.0 records/sec (99.16 MB/sec), 5.9 ms avg latency, 12.0 ms max latency.
501 records sent, 100.0 records/sec (99.20 MB/sec), 5.8 ms avg latency, 11.0 ms max latency.
500 records sent, 100.0 records/sec (99.14 MB/sec), 5.8 ms avg latency, 12.0 ms max latency.
501 records sent, 100.0 records/sec (99.20 MB/sec), 5.9 ms avg latency, 11.0 ms max latency.
501 records sent, 100.2 records/sec (99.34 MB/sec), 6.2 ms avg latency, 32.0 ms max latency.
500 records sent, 99.9 records/sec (99.04 MB/sec), 5.9 ms avg latency, 11.0 ms max latency.
501 records sent, 100.1 records/sec (99.30 MB/sec), 5.7 ms avg latency, 9.0 ms max latency.
501 records sent, 100.0 records/sec (99.20 MB/sec), 5.9 ms avg latency, 22.0 ms max latency.
18000 records sent, 99.996111 records/sec (99.18 MB/sec), 5.94 ms avg latency, 185.00 ms max latency, 6 ms 50th, 7 ms 95th, 9 ms 99th, 26 ms 99.9th.